part-b/result/benchmark_1000000_100.txt
--------------------------------------------------
Benchmark: 1000000 requests, 100 parallel connections
Commands: SET & GET (without pipelining)
--------------------------------------------------
WARNING: Could not fetch server CONFIG
====== SET ======
  1000000 requests completed in 15.85 seconds
  100 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.159 milliseconds (cumulative count 1)
50.000% <= 0.799 milliseconds (cumulative count 503126)
75.000% <= 0.983 milliseconds (cumulative count 752421)
87.500% <= 1.271 milliseconds (cumulative count 876817)
93.750% <= 1.607 milliseconds (cumulative count 937532)
96.875% <= 2.055 milliseconds (cumulative count 968865)
98.438% <= 2.583 milliseconds (cumulative count 984489)
99.219% <= 3.199 milliseconds (cumulative count 992192)
99.609% <= 3.911 milliseconds (cumulative count 996110)
99.805% <= 4.703 milliseconds (cumulative count 998047)
99.902% <= 5.463 milliseconds (cumulative count 999024)
99.951% <= 6.367 milliseconds (cumulative count 999512)
99.976% <= 7.135 milliseconds (cumulative count 999756)
99.988% <= 7.519 milliseconds (cumulative count 999878)
99.994% <= 8.343 milliseconds (cumulative count 999939)
99.997% <= 9.903 milliseconds (cumulative count 999973)
99.998% <= 10.031 milliseconds (cumulative count 999985)
99.999% <= 10.223 milliseconds (cumulative count 999993)
100.000% <= 11.167 milliseconds (cumulative count 999997)
100.000% <= 11.647 milliseconds (cumulative count 999999)
100.000% <= 13.471 milliseconds (cumulative count 1000000)
100.000% <= 13.471 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.001% <= 0.207 milliseconds (cumulative count 5)
0.002% <= 0.303 milliseconds (cumulative count 16)
0.003% <= 0.407 milliseconds (cumulative count 34)
0.063% <= 0.503 milliseconds (cumulative count 631)
0.744% <= 0.607 milliseconds (cumulative count 7440)
13.917% <= 0.703 milliseconds (cumulative count 139166)
52.293% <= 0.807 milliseconds (cumulative count 522927)
68.311% <= 0.903 milliseconds (cumulative count 683110)
76.805% <= 1.007 milliseconds (cumulative count 768045)
81.714% <= 1.103 milliseconds (cumulative count 817137)
85.685% <= 1.207 milliseconds (cumulative count 856853)
88.511% <= 1.303 milliseconds (cumulative count 885111)
90.870% <= 1.407 milliseconds (cumulative count 908700)
92.506% <= 1.503 milliseconds (cumulative count 925060)
93.753% <= 1.607 milliseconds (cumulative count 937532)
94.675% <= 1.703 milliseconds (cumulative count 946750)
95.453% <= 1.807 milliseconds (cumulative count 954534)
96.072% <= 1.903 milliseconds (cumulative count 960723)
96.647% <= 2.007 milliseconds (cumulative count 966470)
97.087% <= 2.103 milliseconds (cumulative count 970870)
99.140% <= 3.103 milliseconds (cumulative count 991401)
99.668% <= 4.103 milliseconds (cumulative count 996677)
99.856% <= 5.103 milliseconds (cumulative count 998565)
99.937% <= 6.103 milliseconds (cumulative count 999366)
99.975% <= 7.103 milliseconds (cumulative count 999749)
99.994% <= 8.103 milliseconds (cumulative count 999937)
99.995% <= 9.103 milliseconds (cumulative count 999946)
99.999% <= 10.103 milliseconds (cumulative count 999985)
99.999% <= 11.103 milliseconds (cumulative count 999995)
100.000% <= 12.103 milliseconds (cumulative count 999999)
100.000% <= 14.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 63103.43 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.954     0.152     0.799     1.743     2.959    13.471
====== GET ======
  1000000 requests completed in 16.12 seconds
  100 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.359 milliseconds (cumulative count 1)
50.000% <= 0.807 milliseconds (cumulative count 504663)
75.000% <= 1.063 milliseconds (cumulative count 752132)
87.500% <= 1.407 milliseconds (cumulative count 875971)
93.750% <= 1.807 milliseconds (cumulative count 938262)
96.875% <= 2.263 milliseconds (cumulative count 968878)
98.438% <= 2.783 milliseconds (cumulative count 984492)
99.219% <= 3.383 milliseconds (cumulative count 992188)
99.609% <= 4.015 milliseconds (cumulative count 996116)
99.805% <= 4.679 milliseconds (cumulative count 998054)
99.902% <= 5.703 milliseconds (cumulative count 999024)
99.951% <= 6.623 milliseconds (cumulative count 999520)
99.976% <= 7.607 milliseconds (cumulative count 999756)
99.988% <= 8.503 milliseconds (cumulative count 999878)
99.994% <= 10.983 milliseconds (cumulative count 999939)
99.997% <= 11.271 milliseconds (cumulative count 999971)
99.998% <= 11.367 milliseconds (cumulative count 999986)
99.999% <= 11.407 milliseconds (cumulative count 999996)
100.000% <= 11.415 milliseconds (cumulative count 999998)
100.000% <= 11.431 milliseconds (cumulative count 999999)
100.000% <= 11.439 milliseconds (cumulative count 1000000)
100.000% <= 11.439 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.003% <= 0.407 milliseconds (cumulative count 25)
0.036% <= 0.503 milliseconds (cumulative count 364)
0.922% <= 0.607 milliseconds (cumulative count 9216)
14.531% <= 0.703 milliseconds (cumulative count 145308)
50.466% <= 0.807 milliseconds (cumulative count 504663)
64.358% <= 0.903 milliseconds (cumulative count 643576)
72.113% <= 1.007 milliseconds (cumulative count 721129)
77.207% <= 1.103 milliseconds (cumulative count 772071)
81.417% <= 1.207 milliseconds (cumulative count 814167)
84.606% <= 1.303 milliseconds (cumulative count 846062)
87.597% <= 1.407 milliseconds (cumulative count 875971)
89.667% <= 1.503 milliseconds (cumulative count 896671)
91.461% <= 1.607 milliseconds (cumulative count 914614)
92.744% <= 1.703 milliseconds (cumulative count 927436)
93.826% <= 1.807 milliseconds (cumulative count 938262)
94.734% <= 1.903 milliseconds (cumulative count 947338)
95.504% <= 2.007 milliseconds (cumulative count 955042)
96.096% <= 2.103 milliseconds (cumulative count 960960)
98.968% <= 3.103 milliseconds (cumulative count 989683)
99.647% <= 4.103 milliseconds (cumulative count 996467)
99.862% <= 5.103 milliseconds (cumulative count 998621)
99.924% <= 6.103 milliseconds (cumulative count 999242)
99.971% <= 7.103 milliseconds (cumulative count 999705)
99.980% <= 8.103 milliseconds (cumulative count 999796)
99.992% <= 9.103 milliseconds (cumulative count 999925)
99.993% <= 10.103 milliseconds (cumulative count 999934)
99.995% <= 11.103 milliseconds (cumulative count 999953)
100.000% <= 12.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 62050.14 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.998     0.352     0.807     1.943     3.135    11.439